# Build tools
brew "meson"
brew "ninja" 
brew "pkg-config"

# Rust toolchain (if not already installed)
brew "rustup-init"

# Core GTK4 and GNOME dependencies
brew "gtk4"
brew "libadwaita"
brew "gtksourceview5"
brew "glib"

# Graphics and text rendering
brew "cairo"
brew "pango"
brew "gdk-pixbuf"
brew "graphene"
brew "libspelling"
brew "blueprint-compiler"

# Accessibility
brew "at-spi2-core"

# Desktop file utilities (for update-desktop-database)
brew "desktop-file-utils"

# App bundling for macOS
brew "dylibbundler"

# Optional: For creating DMG files
brew "create-dmg" 